technical-management-system/app/Http/Controllers/Auth/AuthenticatedSessionController.php

    public function store(LoginRequest $request): RedirectResponse
    {
        $request->authenticate();

        // Update last_login_at to now (Asia/Manila)
        $user = Auth::user();
        if ($user) {
            $user->last_login_at = now('Asia/Manila');
            $user->save();
---
update `users` set `last_login_at` = '2026-03-16 07:26:13', `users`.`updated_at` = '2026-03-16 07:26:13' where `id` = 1