technical-management-system/app/Helpers/AuditLogHelper.php

    public static function log($action, $modelType, $modelId = null, $description = null, $oldValues = null, $newValues = null, $changedFields = null)
    {
        if (app()->bound('request')) {
            request()->attributes->set('audit.explicit_logged', true);
        }

        $user = Auth::user();
        AuditLog::create([
            'user_id' => $user ? $user->id : null,
            'action' => strtoupper($action),
            'model_type' => $modelType,
            'model_id' => $modelId ?? 0,
            'old_values' => $oldValues,
            'new_values' => $newValues,
            'changed_fields' => $changedFields,
            'ip_address' => Request::ip(),
            'user_agent' => Request::header('User-Agent'),
            'session_id' => session()->getId(),
            'url' => Request::fullUrl(),
            'method' => Request::method(),
            'description' => $description,
        ]);
---
insert into `audit_logs` (`user_id`, `action`, `model_type`, `model_id`, `old_values`, `new_values`, `changed_fields`, `ip_address`, `user_agent`, `session_id`, `url`, `method`, `description`) values (1, 'CREATE', 'Backup', 0, null, null, null, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/145.0.0.0 Safari/537.36', '0vqm5cPQXEi0jGKdXdJGuJnNxUDNFS2Am6jMUkr1', 'http://127.0.0.1:8000/admin/settings/backup/create', 'POST', 'Created database backup: backup_2026_03_16_07_50.sql')