technical-management-system/app/Http/Controllers/AdminController.php

    public function dashboard()
    {
        // Admin System Stats - Real data from database
        $stats = [
            'total_users' => User::count(),
            'active_users' => User::where('is_active', true)->count(),
            'inactive_users' => User::where('is_active', false)->count(),
            'admin_users' => User::whereHas('role', function ($query) {
                $query->where('slug', 'admin');
            })->count(),
            'technician_users' => User::whereHas('role', function ($query) {
                $query->where('slug', 'technician');
            })->count(),
            'operator_users' => User::whereHas('role', function ($query) {
                $query->where('slug', 'operator');
            })->count(),
            'customer_users' => User::whereHas('role', function ($query) {
                $query->where('slug', 'customer');
            })->count(),
        ];

        // Recent User Activity - Real data from database
        $recentUserActivity = User::latest('updated_at')
            ->limit(8)
            ->get()
            ->map(function ($user) {
                $lastLogin = $user->last_login_at ?? $user->updated_at;
                $lastLoginFormatted = 'Never';
                if ($lastLogin) {
                    try {
                        if (!($lastLogin instanceof \Carbon\Carbon)) {
                            $lastLogin = \Carbon\Carbon::parse($lastLogin);
                        }
                        $lastLoginFormatted = $lastLogin->timezone('Asia/Manila')->format('M d, Y h:i A');
                    } catch (\Exception $e) {
                        $lastLoginFormatted = 'Invalid date';
                    }
                }
                return (object) [
                    'id' => $user->id,
                    'name' => $user->name,
                    'email' => $user->email,
                    'role' => $user->role?->name ?? 'N/A',
                    'last_login' => $lastLoginFormatted,
                    'is_active' => $user->is_active ?? true,
---
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `is_active` = 1
select count(*) as aggregate from `users` where `is_active` = 0
select count(*) as aggregate from `users` where exists (select * from `roles` where `users`.`role_id` = `roles`.`id` and `slug` = 'admin')
select count(*) as aggregate from `users` where exists (select * from `roles` where `users`.`role_id` = `roles`.`id` and `slug` = 'tech_personnel')
select count(*) as aggregate from `users` where exists (select * from `roles` where `users`.`role_id` = `roles`.`id` and `slug` = 'tech_head')
select count(*) as aggregate from `users` where exists (select * from `roles` where `users`.`role_id` = `roles`.`id` and `slug` = 'marketing')
select * from `users` order by `updated_at` desc limit 8

            });

        // Recent Audit Activity - Real data from database
        $auditActivity = AuditLog::latest('created_at')
            ->limit(5)
            ->get()
            ->map(function ($log) {
                return (object) [
                    'id' => $log->id,
                    'action' => $log->action ?? 'Unknown Action',
                    'model' => $log->model ?? 'System',
                    'ref_id' => $log->ref_id ?? 'N/A',
                    'user_name' => $log->user?->name ?? 'System',
                    'created_at' => $log->created_at,
                ];
            });
---
select * from `audit_logs` order by `created_at` desc limit 5

            $databaseOk = false;
        }

        $activeUsersCount = User::where('is_active', true)->count();
        $totalUsersCount = User::count();
        $recentAuditCount = AuditLog::where('created_at', '>=', now()->subDay())->count();
---
select count(*) as aggregate from `users` where `is_active` = 1
select count(*) as aggregate from `users`
select count(*) as aggregate from `audit_logs` where `created_at` >= '2026-03-15 09:05:08'

    public function users(Request $request)
    {
        $search = $request->string('search')->toString();
        $role = $request->string('role')->toString();
        $status = $request->string('status')->toString();

        $query = User::with('role')->orderBy('name');

        if ($search) {
            $query->where(function ($q) use ($search) {
                $q->where('name', 'like', "%{$search}%")
                  ->orWhere('email', 'like', "%{$search}%");
            });
        }

        if ($role) {
            $query->where('role_id', $role);
        }

        if ($status !== '') {
            if ($status === 'active') {
                $query->where('is_active', true);
            } elseif ($status === 'inactive') {
                $query->where('is_active', false);
            }
        }

        $users = $query->paginate(15)->appends([
            'search' => $search,
            'role' => $role,
            'status' => $status,
        ]);
---
select * from `users` order by `name` asc limit 15 offset 0
select * from `roles` order by `name` asc
select count(*) as aggregate from `users` where `is_active` = 0

    public function storeUser(Request $request)
    {
        $validated = $request->validate([
            'name' => 'required|string|max:255',
            'email' => 'required|email|max:255|unique:users,email',
            'role_id' => 'required|exists:roles,id',
            'status' => 'required|in:active,inactive',
            'password' => 'required|string|min:6|confirmed',
        ]);

        $user = User::create([
            'name' => $validated['name'],
            'email' => $validated['email'],
            'role_id' => $validated['role_id'],
            'is_active' => $validated['status'] === 'active',
            'password' => Hash::make($validated['password']),
        ]);
---
insert into `users` (`name`, `email`, `role_id`, `is_active`, `password`, `updated_at`, `created_at`) values ('DELETE_ME', 'delete@gmail.com', '15', 1, '$2y$12$sixH5kQllI3wTjt866/onuQQ6XsvvBNm4PzFnBMnu8TzQYkMgLNP2', '2026-03-16 08:32:16', '2026-03-16 08:32:16')

    public function deleteUser(User $user)
    {
        $userName = $user->name;
        $userEmail = $user->email;
        $userId = $user->id;

        $user->delete();
---
delete from `users` where `id` = 20