technical-management-system/app/Http/Controllers/AuditLogController.php

select distinct `department` from `users` where `department` is not null and `department` != '' order by `department` asc
---
        }

        $auditLogs = $query->paginate(12);
        $departments = User::whereNotNull('department')
            ->where('department', '!=', '')
            ->distinct()
            ->orderBy('department')
            ->pluck('department');