technical-management-system/app/Http/Controllers/InventoryController.php

select count(*) as aggregate from `inventory_items`
select count(*) as aggregate from `inventory_items` where `status` = 'out'
select distinct `category` from `inventory_items` where `category` is not null order by `category` asc
select count(*) as aggregate from `inventory_requests`
---
    private function renderIndex(Request $request, string $view)
    {
        $query = InventoryItem::query();

        if ($request->filled('search')) {
            $search = $request->get('search');
            $query->where(function ($q) use ($search) {
                $q->where('name', 'like', "%{$search}%")
                    ->orWhere('sku', 'like', "%{$search}%");
            });
        }

        if ($request->filled('category')) {
            $query->where('category', $request->get('category'));
        }

        if ($request->filled('status')) {
            $query->where('status', $request->get('status'));
        }

        $items = $query->orderBy('name')->paginate(20)->withQueryString();

        $stats = [
            'totalItems' => InventoryItem::count(),
            'lowStock' => InventoryItem::where('status', 'low')->count(),
            'outOfStock' => InventoryItem::where('status', 'out')->count(),
        ];

        $categories = InventoryItem::whereNotNull('category')
            ->select('category')
            ->distinct()
            ->orderBy('category')
            ->pluck('category');
        $requests = null;
        if (in_array($view, ['admin.inventory', 'tech-head.inventory'], true)) {
            $requests = InventoryRequest::with(['inventoryItem', 'user'])
                ->latest('created_at')
                ->paginate(10, ['*'], 'requests_page')
                ->withQueryString();