technical-management-system/app/Http/Controllers/ProfileController.php

    public function show(Request $request): View
    {
        $user = $request->user();

        // Get user's assignments summary
        $assignmentStats = \App\Models\Assignment::where('assigned_to', $user->id)
            ->selectRaw('COUNT(*) as total, SUM(CASE WHEN status = "completed" THEN 1 ELSE 0 END) as completed, SUM(CASE WHEN status IN ("assigned", "in_progress") THEN 1 ELSE 0 END) as active')
            ->first();

        // Get recent activity logs
        $recentActivity = \App\Models\AuditLog::where('user_id', $user->id)
            ->orderBy('created_at', 'desc')
            ->take(5)
            ->get();
---
select COUNT(*) as total, SUM(CASE WHEN status = "completed" THEN 1 ELSE 0 END) as completed, SUM(CASE WHEN status IN ("assigned", "in_progress") THEN 1 ELSE 0 END) as active from `assignments` where `assigned_to` = 1 limit 1
select * from `audit_logs` where `user_id` = 1 order by `created_at` desc limit 5