technical-management-system/app/Http/Controllers/RoleController.php

    public function index()
    {
        $roles = Role::with([
            'users' => function ($query) {
                $query->select('id', 'role_id', 'name', 'email', 'is_active')->orderBy('name');
            },
        ])->withCount('users')->get();
---
select `id`, `role_id`, `name`, `email`, `is_active` from `users` where `users`.`role_id` in (1, 2, 3, 4, 5, 14, 15) order by `name` asc